; domain
(define (domain hanoi-domain)
    (:predicates 
        (on-tower ?d ?t) ; disk d is on tower t
        (on-disk ?d1 ?d2) ; disk d1 is on disk d2
        (disk ?d) ; d is a disk
        (tower ?t) ; t is a tower
        (empty ?t) ; tower t is empty
        (smaller ?d1 ?d2) ; disk d1 is smaller than disk d2
        (on-top ?d ?t) ; disk d is on top of tower t
    )
    
    ; move disk from disk to tower
    ; ?d is the disk to move
    ; ?df is the disk under disk ?d
    ; ?t1 is the tower ?d is on
    ; ?t2 is the tower to move ?d to
    (:action move-d-to-t
        :parameters (?d ?df ?t1 ?t2)
        :precondition (and 
            (disk ?d)
            (disk ?df)
            (tower ?t1)
            (tower ?t2)
            (empty ?t2)
            (on-disk ?d ?df)
            (on-top ?d ?t1)
            )
        :effect (and 
            (on-top ?df ?t1)
            (not (empty ?t2))
            (not (on-disk ?d ?df))
            (on-tower ?d ?t2)
            (on-top ?d ?t2)
            (not (on-top ?d ?t1))
            )
    )
    
    ; move disk from disk to disk
    ; ?d is the disk to move
    ; ?df is the disk under disk ?d
    ; ?dt is the disk to move ?d to
    ; ?t1 is the tower ?d is on
    ; ?t2 is the tower ?dt is on
    (:action move-d-to-d
        :parameters (?d ?df ?dt ?t1 ?t2)
        :precondition (and 
            (disk ?d)
            (disk ?df)
            (disk ?dt)
            (on-top ?d ?t1)
            (on-top ?dt ?t2)
            (tower ?t1)
            (tower ?t2)
            (on-disk ?d ?df)
            (smaller ?d ?dt)
            )
        :effect (and 
            (on-top ?df ?t1)
            (not (on-top ?d ?t1))
            (on-top ?d ?t2)
            (on-disk ?d ?dt)
            (not (on-top ?dt ?t2))
            (not (on-disk ?d ?df))
            )
    )

    ; move disk from tower to tower
    ; ?d is the disk to move
    ; ?t1 is the tower ?d is on
    ; ?t2 is the tower to move ?d to
    (:action move-t-to-t
        :parameters (?d ?t1 ?t2)
        :precondition (and 
            (disk ?d)
            (tower ?t1)
            (tower ?t2)
            (empty ?t2)
            (on-tower ?d ?t1)
            (on-top ?d ?t1)
            )
        :effect (and
            (empty ?t1)
            (not (empty ?t2))
            (on-tower ?d ?t2)
            (not (on-tower ?d ?t1))
            (on-top ?d ?t2)
            (not (on-top ?d ?t1))
            )
    )

    ; move disk from tower to disk
    ; ?d is the disk to move
    ; ?dt is the disk to move ?d to
    ; ?t1 is the tower ?d is on
    ; ?t2 is the tower ?dt is on
    (:action move-t-to-d
        :parameters (?d ?dt ?t1 ?t2)
        :precondition (and 
            (disk ?d)
            (disk ?dt)
            (tower ?t1)
            (tower ?t2)
            (on-top ?d ?t1)
            (on-tower ?d ?t1)
            (on-top ?dt ?t2)
            (smaller ?d ?dt)
            )
        :effect (and
            (not (on-top ?d ?t1))
            (on-top ?d ?t2)
            (not (on-tower ?d ?t1))
            (empty ?t1)
            (on-disk ?d ?dt)
            (not (on-top ?dt ?t2))
        )
    )
)

; problem
(define (problem hanoi-problem) (:domain hanoi-domain)
    (:objects
        tower1 tower2 tower3
        disk1 disk2 disk3 disk4 disk5 
    )
    
    (:init
        (tower tower1)
        (tower tower2)
        (tower tower3)
        (disk disk1)
        (on-disk disk1 disk2)
        (smaller disk1 disk2)
        (smaller disk1 disk3)
        (smaller disk1 disk4)
        (smaller disk1 disk5)
        (disk disk2)
        (on-disk disk2 disk3)
        (smaller disk2 disk3)
        (smaller disk2 disk4)
        (smaller disk2 disk5)
        (disk disk3)
        (on-disk disk3 disk4)
        (smaller disk3 disk4)
        (smaller disk3 disk5)
        (disk disk4)
        (on-disk disk4 disk5)
        (smaller disk4 disk5)
        (disk disk5)
        (on-tower disk5 tower1)
        (not (empty tower1))
        (empty tower2)
        (empty tower3)
        (on-top disk1 tower1)
    )
        
    (:goal (and
        (empty tower1)
        (empty tower2)
        (on-top disk1 tower3)
        (on-disk disk1 disk2)
        (on-disk disk2 disk3)
        (on-disk disk3 disk4)
        (on-disk disk4 disk5)
        (on-tower disk5 tower3)
        )
    )
)

; plan
1. (move-d-to-t disk1 disk2 tower1 tower3)
   deleted: (empty tower3) (on-disk disk1 disk2) (on-top disk1 tower1)
   added: (on-top disk2 tower1) (on-tower disk1 tower3) (on-top disk1 tower3)
   goals met: 5 of 8
2. (move-d-to-t disk2 disk3 tower1 tower2)
   deleted: (empty tower2) (on-disk disk2 disk3) (on-top disk2 tower1)
   added: (on-top disk3 tower1) (on-tower disk2 tower2) (on-top disk2 tower2)
   goals met: 3 of 8
3. (move-t-to-d disk1 disk2 tower3 tower2)
   deleted: (on-top disk1 tower3) (on-tower disk1 tower3) (on-top disk2 tower2)
   added: (on-top disk1 tower2) (empty tower3) (on-disk disk1 disk2)
   goals met: 3 of 8
4. (move-d-to-t disk3 disk4 tower1 tower3)
   deleted: (empty tower3) (on-disk disk3 disk4) (on-top disk3 tower1)
   added: (on-top disk4 tower1) (on-tower disk3 tower3) (on-top disk3 tower3)
   goals met: 2 of 8
5. (move-d-to-d disk1 disk2 disk4 tower2 tower1)
   deleted: (on-top disk1 tower2) (on-top disk4 tower1) (on-disk disk1 disk2)
   added: (on-top disk2 tower2) (on-top disk1 tower1) (on-disk disk1 disk4)
   goals met: 1 of 8
6. (move-t-to-d disk2 disk3 tower2 tower3)
   deleted: (on-top disk2 tower2) (on-tower disk2 tower2) (on-top disk3 tower3)
   added: (on-top disk2 tower3) (empty tower2) (on-disk disk2 disk3)
   goals met: 3 of 8
7. (move-d-to-d disk1 disk4 disk2 tower1 tower3)
   deleted: (on-top disk1 tower1) (on-top disk2 tower3) (on-disk disk1 disk4)
   added: (on-top disk4 tower1) (on-top disk1 tower3) (on-disk disk1 disk2)
   goals met: 5 of 8
8. (move-d-to-t disk4 disk5 tower1 tower2)
   deleted: (empty tower2) (on-disk disk4 disk5) (on-top disk4 tower1)
   added: (on-top disk5 tower1) (on-tower disk4 tower2) (on-top disk4 tower2)
   goals met: 3 of 8
9. (move-d-to-d disk1 disk2 disk4 tower3 tower2)
   deleted: (on-top disk1 tower3) (on-top disk4 tower2) (on-disk disk1 disk2)
   added: (on-top disk2 tower3) (on-top disk1 tower2) (on-disk disk1 disk4)
   goals met: 1 of 8
10. (move-d-to-d disk2 disk3 disk5 tower3 tower1)
   deleted: (on-top disk2 tower3) (on-top disk5 tower1) (on-disk disk2 disk3)
   added: (on-top disk3 tower3) (on-top disk2 tower1) (on-disk disk2 disk5)
   goals met: 0 of 8
11. (move-d-to-d disk1 disk4 disk2 tower2 tower1)
   deleted: (on-top disk1 tower2) (on-top disk2 tower1) (on-disk disk1 disk4)
   added: (on-top disk4 tower2) (on-top disk1 tower1) (on-disk disk1 disk2)
   goals met: 1 of 8
12. (move-t-to-d disk3 disk4 tower3 tower2)
   deleted: (on-top disk3 tower3) (on-tower disk3 tower3) (on-top disk4 tower2)
   added: (on-top disk3 tower2) (empty tower3) (on-disk disk3 disk4)
   goals met: 2 of 8
13. (move-d-to-t disk1 disk2 tower1 tower3)
   deleted: (empty tower3) (on-disk disk1 disk2) (on-top disk1 tower1)
   added: (on-top disk2 tower1) (on-tower disk1 tower3) (on-top disk1 tower3)
   goals met: 2 of 8
14. (move-d-to-d disk2 disk5 disk3 tower1 tower2)
   deleted: (on-top disk2 tower1) (on-top disk3 tower2) (on-disk disk2 disk5)
   added: (on-top disk5 tower1) (on-top disk2 tower2) (on-disk disk2 disk3)
   goals met: 3 of 8
15. (move-t-to-d disk1 disk2 tower3 tower2)
   deleted: (on-top disk1 tower3) (on-tower disk1 tower3) (on-top disk2 tower2)
   added: (on-top disk1 tower2) (empty tower3) (on-disk disk1 disk2)
   goals met: 3 of 8
16. (move-t-to-t disk5 tower1 tower3)
   deleted: (empty tower3) (on-tower disk5 tower1) (on-top disk5 tower1)
   added: (empty tower1) (on-tower disk5 tower3) (on-top disk5 tower3)
   goals met: 5 of 8
17. (move-d-to-t disk1 disk2 tower2 tower1)
   deleted: (empty tower1) (on-disk disk1 disk2) (on-top disk1 tower2)
   added: (on-top disk2 tower2) (on-tower disk1 tower1) (on-top disk1 tower1)
   goals met: 3 of 8
18. (move-d-to-d disk2 disk3 disk5 tower2 tower3)
   deleted: (on-top disk2 tower2) (on-top disk5 tower3) (on-disk disk2 disk3)
   added: (on-top disk3 tower2) (on-top disk2 tower3) (on-disk disk2 disk5)
   goals met: 2 of 8
19. (move-t-to-d disk1 disk2 tower1 tower3)
   deleted: (on-top disk1 tower1) (on-tower disk1 tower1) (on-top disk2 tower3)
   added: (on-top disk1 tower3) (empty tower1) (on-disk disk1 disk2)
   goals met: 5 of 8
20. (move-d-to-t disk3 disk4 tower2 tower1)
   deleted: (empty tower1) (on-disk disk3 disk4) (on-top disk3 tower2)
   added: (on-top disk4 tower2) (on-tower disk3 tower1) (on-top disk3 tower1)
   goals met: 3 of 8
21. (move-d-to-d disk1 disk2 disk4 tower3 tower2)
   deleted: (on-top disk1 tower3) (on-top disk4 tower2) (on-disk disk1 disk2)
   added: (on-top disk2 tower3) (on-top disk1 tower2) (on-disk disk1 disk4)
   goals met: 1 of 8
22. (move-d-to-d disk2 disk5 disk3 tower3 tower1)
   deleted: (on-top disk2 tower3) (on-top disk3 tower1) (on-disk disk2 disk5)
   added: (on-top disk5 tower3) (on-top disk2 tower1) (on-disk disk2 disk3)
   goals met: 2 of 8
23. (move-d-to-d disk1 disk4 disk2 tower2 tower1)
   deleted: (on-top disk1 tower2) (on-top disk2 tower1) (on-disk disk1 disk4)
   added: (on-top disk4 tower2) (on-top disk1 tower1) (on-disk disk1 disk2)
   goals met: 3 of 8
24. (move-t-to-d disk4 disk5 tower2 tower3)
   deleted: (on-top disk4 tower2) (on-tower disk4 tower2) (on-top disk5 tower3)
   added: (on-top disk4 tower3) (empty tower2) (on-disk disk4 disk5)
   goals met: 5 of 8
25. (move-d-to-d disk1 disk2 disk4 tower1 tower3)
   deleted: (on-top disk1 tower1) (on-top disk4 tower3) (on-disk disk1 disk2)
   added: (on-top disk2 tower1) (on-top disk1 tower3) (on-disk disk1 disk4)
   goals met: 5 of 8
26. (move-d-to-t disk2 disk3 tower1 tower2)
   deleted: (empty tower2) (on-disk disk2 disk3) (on-top disk2 tower1)
   added: (on-top disk3 tower1) (on-tower disk2 tower2) (on-top disk2 tower2)
   goals met: 3 of 8
27. (move-d-to-d disk1 disk4 disk2 tower3 tower2)
   deleted: (on-top disk1 tower3) (on-top disk2 tower2) (on-disk disk1 disk4)
   added: (on-top disk4 tower3) (on-top disk1 tower2) (on-disk disk1 disk2)
   goals met: 3 of 8
28. (move-t-to-d disk3 disk4 tower1 tower3)
   deleted: (on-top disk3 tower1) (on-tower disk3 tower1) (on-top disk4 tower3)
   added: (on-top disk3 tower3) (empty tower1) (on-disk disk3 disk4)
   goals met: 5 of 8
29. (move-d-to-t disk1 disk2 tower2 tower1)
   deleted: (empty tower1) (on-disk disk1 disk2) (on-top disk1 tower2)
   added: (on-top disk2 tower2) (on-tower disk1 tower1) (on-top disk1 tower1)
   goals met: 3 of 8
30. (move-t-to-d disk2 disk3 tower2 tower3)
   deleted: (on-top disk2 tower2) (on-tower disk2 tower2) (on-top disk3 tower3)
   added: (on-top disk2 tower3) (empty tower2) (on-disk disk2 disk3)
   goals met: 5 of 8
31. (move-t-to-d disk1 disk2 tower1 tower3)
   deleted: (on-top disk1 tower1) (on-tower disk1 tower1) (on-top disk2 tower3)
   added: (on-top disk1 tower3) (empty tower1) (on-disk disk1 disk2)
   goals met: 8 of 8
